logs/backup_benchmark_20250709_194015/h2_0ms_1pct.log
=== HTTP/2 BENCHMARK RESULTS ===
=== NETWORK CONDITIONS ===
Timestamp: 2025-07-09 19:40:25
Delay: 0ms
Loss: 1%
Router IP: 172.30.0.254
Server IP: 172.30.0.2
Current qdisc configuration:
qdisc netem 1: root refcnt 9 limit 1000 delay 150ms loss 1%
qdisc tbf 10: parent 1:1 rate 600Mbit burst 4050b lat 400ms 

=== CONNECTION ESTABLISHMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 1000 total requests
spawning thread #1: 5 total client(s). 1000 total requests
spawning thread #2: 5 total client(s). 1000 total requests
spawning thread #3: 5 total client(s). 1000 total requests
spawning thread #4: 5 total client(s). 1000 total requests
spawning thread #5: 5 total client(s). 1000 total requests
spawning thread #6: 5 total client(s). 1000 total requests
spawning thread #7: 5 total client(s). 1000 total requests
spawning thread #8: 5 total client(s). 1000 total requests
spawning thread #9: 5 total client(s). 1000 total requests
spawning thread #10: 5 total client(s). 1000 total requests
spawning thread #11: 5 total client(s). 1000 total requests
spawning thread #12: 5 total client(s). 1000 total requests
spawning thread #13: 5 total client(s). 1000 total requests
spawning thread #14: 5 total client(s). 1000 total requests
spawning thread #15: 5 total client(s). 1000 total requests
spawning thread #16: 5 total client(s). 1000 total requests
spawning thread #17: 5 total client(s). 1000 total requests
spawning thread #18: 5 total client(s). 1000 total requests
spawning thread #19: 5 total client(s). 1000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 297.21ms, 67292.49 req/s, 19.52MB/s
requests: 20000 total, 20000 started, 20000 done, 20000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 20000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 5.80MB (6083559) total, 4.06MB (4258906) headers (space savings 27.82%), 1.14MB (1200000) data
                     min         max         mean         sd        +/- sd
time for request:    29.66ms     95.50ms     66.93ms     20.44ms    51.53%
time for connect:     3.09ms    138.13ms     71.30ms     45.81ms    52.00%
time to 1st byte:    32.79ms    227.65ms    136.46ms     69.35ms    53.00%
req/s           :     686.21     2587.44     1129.93      531.02    86.00%
Waiting 5s for connections to stabilize...
=== MEASUREMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 9000 total requests
spawning thread #1: 5 total client(s). 9000 total requests
spawning thread #2: 5 total client(s). 9000 total requests
spawning thread #3: 5 total client(s). 9000 total requests
spawning thread #4: 5 total client(s). 9000 total requests
spawning thread #5: 5 total client(s). 9000 total requests
spawning thread #6: 5 total client(s). 9000 total requests
spawning thread #7: 5 total client(s). 9000 total requests
spawning thread #8: 5 total client(s). 9000 total requests
spawning thread #9: 5 total client(s). 9000 total requests
spawning thread #10: 5 total client(s). 9000 total requests
spawning thread #11: 5 total client(s). 9000 total requests
spawning thread #12: 5 total client(s). 9000 total requests
spawning thread #13: 5 total client(s). 9000 total requests
spawning thread #14: 5 total client(s). 9000 total requests
spawning thread #15: 5 total client(s). 9000 total requests
spawning thread #16: 5 total client(s). 9000 total requests
spawning thread #17: 5 total client(s). 9000 total requests
spawning thread #18: 5 total client(s). 9000 total requests
spawning thread #19: 5 total client(s). 9000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 12.67s, 14211.96 req/s, 4.12MB/s
requests: 180000 total, 180000 started, 180000 done, 180000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 180000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 52.20MB (54740192) total, 36.58MB (38355292) headers (space savings 27.81%), 10.30MB (10800000) data
                     min         max         mean         sd        +/- sd
time for request:      425us    806.85ms    347.20ms    202.01ms    58.14%
time for connect:     3.26ms    115.64ms     62.32ms     30.64ms    60.00%
time to 1st byte:    43.54ms    712.50ms    330.83ms    202.24ms    61.00%
req/s           :     142.14      152.13      143.29        1.48    89.00%

=== BENCHMARK SUMMARY ===
Protocol: HTTP/2
Fair Comparison: Enabled
Warmup Requests: 20000
Measurement Requests: 180000
End Time: 2025-07-09 19:40:43
CSV Log: /logs/benchmark_20250709_194015/h2_0ms_1pct.csv